{
  "plugin.dependencies": "",
  "plugin.author": "fickletcell",
  "plugin.description": "50 facts about minecraft",
  "plugin.version": "beta-0.12",
  "open-tab": 0,
  "plugin-components": [
    {
      "children": [{
        "=": "eff14931e00daf05213ef71baa4f2fea",
        "parameters": [
          {"=": "6d7e3ffc65ab709a11c739519d54a472"},
          {
            "=": "expr-new-string",
            "parameters": ["&2yo you are cool plugin is enabled!!!!"]
          }
        ]
      }],
      "=": "comp-plugin-enable"
    },
    {
      "children": [{
        "=": "eff14931e00daf05213ef71baa4f2fea",
        "parameters": [
          {"=": "expr-command-sender"},
          {
            "=": "expr-random-list-element",
            "parameters": [{
              "size": 50,
              "=": "expr-new-list",
              "parameters": [
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The first version of Minecraft (known as Cave Game at the time) was created in six days. Six. 10 May 2009 to 16 May 2009."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Minecraft was created by Swedish designer and programmer Markus Persson (known as \"Notch\" by fans). He wanted Minecraft to allow exploration of the virtual world that was free and organic, for his new company, Mojang AB."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The full version of Minecraft was completed on 18 November 2011, after which it was first released and made known to the world."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6What is known as Minecraft was originally called Cave Game, then Minecraft: Order of the Stone, before simply Minecraft."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The sounds that Ghasts make comes from a sleeping cat. Namely, Minecraft's music producer Daniel 'C418' Rosenfeld's cat, who was accidentally recorded waking from sleep."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Minecraft was inspired by other known computer games, such as Dungeon Keeper, RollerCoaster Tycoon, Infiniminer and Dwarf Fortress."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6A creeper was initially supposed to be a pig. Persson switched the height and length of a creeper by mistake when inputting the code."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The original Enderman had green eyes. The mobs from the land of Ender now have purple eyes and, still, only attack when aggravated by a player."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The crafting table in Minecraft, where players create a number of items and blocks, was formerly called workbench."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6There was once going to be a Sky Dimension in Minecraft, in addition to the others: The End, Far Lands, Overworld, Void, Outer End and The Nether. Before the idea was scrapped, it was going to be the opposite of The Nether."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Once in every 10,000 times you play Minecraft, the menu at the start will flash a misspelling of its name - you'll see \"Minceraft\" instead of \"Minecraft\"."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&61 block is 1 cubic metre (the size of a cube that is 1 metre long, 1 metre wide and 1 metre high)."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Persson's avatar in the game is the only one who drops an apple when he dies."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Creepers are afraid of ocelots (wild cat mobs which are passive, but attack chickens in Minecraft)."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Microsoft purchased Minecraft for 2.5 billion dollars (1.9 billion pounds) in 2014."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Normally, the hostile zombie mobs burn during the day. The exception to this is if they are in a cobweb - a type of block which slows down movement."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Many think Minecraft is infinite, and that players can keep venturing further and further out in their world. However, if a player does so, they will eventually arrive at the \"World Boundary\", where they won't be able to go any further."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The World Boundary has several layers to block players from getting past. After getting past the first two layers, the game will crash."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Around 126 million people people play Minecraft every month."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Over 200 million copies of Minecraft have been sold worldwide."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Minecraft is compulsory education for 13-year-olds at Viktor Rydberg secondary school in Stockholm, Sweden. This is said to be because it helps to teach city planning, planning for the future, and environmental issues."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The Enderman language is the English language backwards, and sometimes just at a lower pitch. Yep, it was English all along."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6A scale replica of the entire country of Denmark has been created in Minecraft. This was done by Simon Kokkendorf and Thorbjorn Nielsen of the Danish Geodata Agency."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The Rarest item in Minecraft is the Dragon Egg. It will only appear when the Ender Dragon has been defeated, at which point, the Dragon Egg will appear on the exit portal. If there aren't any air blocks to teleport into, the egg may be mined."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The diamond ore block, emerald ore block and pink wool block are among the rarest to mine in the game, like (but after) the Dragon Egg."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6A fishing rod can be used to hook more than just fish! It can hook treasure, mobs and even other players."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6One day in Minecraft is 20 minutes in real-time."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6A good way for a player to block out hostile mobs is to build a fence around their farm, as they can't climb over fences."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6If a player needs easy access to their farm that has a fence around it, they can lay a carpet on top of it! They'll be able to climb over but the mobs won't"]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6There are six types of mob: the utility mob, boss mob, hostile mob, neutral mob, tamable mob, and the passive mob."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Not all mobs are harmful. Utility mobs were created to protect villagers and players in the game from the hostile mobs. The Iron Golem and Snow Golem are examples of utility mobs."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The boss mobs in Minecraft are the strongest and most powerful mobs. At present, these are the Enderdragon and Wither."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The Skeleton Horseman, Evoker, Ghast, and Phantom are examples of hostile mobs - they'll attack any player in sight at any time!"]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The higher a wolf's tail in the game, the healthier it is."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Neutral mobs only attack when provoked; their aggressiveness must be triggered. The panda, bee and dolphin are examples of neutral mobs."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Tameable mobs in Minecraft can become a player's pet. Examples of these are the donkey, mule, trader llama, llama, wolf, cat, parrot, horse, and the skeleton horse."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The passive mobs are non-violent (hence the name). The turtle, chicken, horse, and donkey are a few of the passive mobs in Minecraft. Even when they are provoked, they'll run from danger."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Creepers in Minecraft detonate because they get very nervous and shake a lot, setting themselves off in a similar way to how the rubbing of two sticks starts a fire."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6One of the many useful things to build in Minecraft is a smoker, as it cooks food twice as quickly as a furnace."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Did you know that Minecraft can be enjoyed by players aged three and up (including adults)?"]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6There's a \"Peaceful Mode\" without mobs (hostile, non-player characters, like creepers, zombies and animals) which makes the game less violent for the younger ones."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6There are 107 Minecraft achievements in the game.till 2020 only."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Enderman is a three-block-tall mob that brings chaos in the game."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The ambient background music and sound effects of Minecraft were produced by a German Musician named Daniel Rosenfeld or much known as C418 (C4-Eighteen)."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6As of this writing, 176 million people have purchased Minecraft with 200 million registered users (and still growing). till 2020."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6US is the #1 country that plays Minecraft."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6It takes around 1 GB on average to install Minecraft."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Minecraft’s creation was inspired by other games such as Dwarf Fortress, Dungeon Keeper, Infiniminer, and RollerCoaster Tycoon. Hence, Markus Persson was inspired to match its creativity for Role-Playing Games."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The Enderman mobs have their language. It talks in English but backwards. Moreover, the “Enderian Language” has a British accent played in a lowered pitch."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6The Ghast mob of Minecraft is the second-largest mob in the game."]
                }
              ]
            }]
          }
        ]
      }],
      "=": "comp-command",
      "parameters": [
        "fact",
        "",
        "facts about minecraft",
        "mc.fact",
        "no no you cant",
        "/fact"
      ]
    },
    {
      "children": [{
        "=": "eff14931e00daf05213ef71baa4f2fea",
        "parameters": [
          {"=": "expr-command-sender"},
          {
            "=": "expr-random-list-element",
            "parameters": [{
              "size": 20,
              "=": "expr-new-list",
              "parameters": [
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Herobrine it self joined 2b2t (account name XD)."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t has a naturally spawning snow golem."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t is also in a art museum."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t has beed in actual books"]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6pyrobyte's(king of the server at his time) dog is still alive"]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6All big minecraft hackers/dev's can be found in 2b2t"]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Every big youtuber once visited 2b2t including Mr.Beast."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Some people have command blocks in 2b2t but never placed."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t Owner Account name is hausemaster."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6Hausemaster also destroied one base."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t hasn't skiped a night in 5 years last in 2016."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t's player once have a Ghast spwaner."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t queue record is 2000 players at once."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t have bedrock in end by mistaake."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t have holes in bedrock in nether."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t motd is random and made by its member."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t is still on outdated minecraft"]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6A 2b2t player was visited by the USA secret service."]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&62b2t is the oldest anarchy server "]
                },
                {
                  "=": "expr-new-string",
                  "parameters": ["&c==>&6FitMC is the respected youtuber to cover all 2b2t news"]
                }
              ]
            }]
          }
        ]
      }],
      "=": "comp-command",
      "parameters": [
        "2b2t",
        "",
        "facts about 2b2t minecraft",
        "mc.fact2b2t",
        "no no you cant",
        "/fact 2b2t"
      ]
    },
    {
      "children": [{
        "=": "eff14931e00daf05213ef71baa4f2fea",
        "parameters": [
          {"=": "6d7e3ffc65ab709a11c739519d54a472"},
          {
            "=": "expr-new-string",
            "parameters": ["&2yo i will miss you!!!!"]
          }
        ]
      }],
      "=": "comp-plugin-disable"
    }
  ],
  "plugin.website": "",
  "plugin.soft-dependencies": "",
  "plugin.name": "funfacts"
}